{"_id":"note:1nrBXhg6oAX","title":"Week 02","content":"# Week 02\n## Logic Blocks:\nThere are two types:\n1. **Combinational**: without memory\n2. **Sequential**: with memory\n\nInputs are binary, High/Low.\n\n### Electricity\n$V=IR$\n\nThe voltage is continuous in time, and it's hard to measure accurately. Can we go from analog to digital? This process is called **digitizing**. There are only two values, high and low, and it's **Direct Current**. We work with Digital circuits, not analog circuits. We will use truth tables to specify circuit behaviour, but it's not very discriptive. Instead, we can use **Boolean algebra**. \n- $AB$ is AND\n- $A+B$ is OR\n- $\\neg{A}$ or $\\bar{A}$ is NOT\n\nAny boolean function can be represented as a **sum of products** (OR of ANDs) of literals.\n\nSometimes, in truth tables, there will be an $X$. This symbolizes that we \"don't care\" about that value; it can be 1 or 0.\n\nA | B | C | F\n--- | --- | --- | ---\n0|0|X|0\n0|1|X|1\n1|X|X|X\n\nThis greatly simplifies the truth table, condensing similar cases together. We can use Boolean algebra to simplify terms as well.\n\n### Boolean Algebra Axioms:\nRule | Dual Rule\n---|---\n$\\overline{\\overline{X}} = X$ |  -\n$X + 0 = X$ | $X1=X$\n$X+1 = 1$ | $X0 = 0$\n$X+X=X$ | $XX = X$\n$X+\\bar{X}=1$ | $X\\bar{X}=0$\n$X + Y = Y + X$ | $XY=YX$\n$X + (Y + Z) = (X+Y)+Z$ |$X(YZ)=(XY)Z$\n$X(Y+Z)=XY+XZ$ | $X+YZ=(X+Y)(X+Z)$\n$\\overline{X+Y}=\\bar{X}\\bar{Y}$| $\\overline{XY}=\\bar{X}+\\bar{Y}$\n\nThe last one in the chart is DeMorgan's law.\n\nWe can use these axioms to simplify boolean algebra formulae.\n\nThe standard gate symbols are used in this course.\n\n![e4464dc6.png](e4464dc6-kl2ssw7p.png)\nThe XOR construction.\n\nBe careful with formatting! You can represent inputs multiple times:\n![3e475b87.png](3e475b87-kl2ssw7p.png)\n\n\n## Transistors\nBlahblah history.\n\nA transistor is just an electrically-controlled switch.\nWe will be looking at an NMOS transistor:\n![93087916.png](93087916-kl2ssw7p.png)\nIt's not really truly opened or closed; it's a matter of changing resistance.\nIf $V_{gate}$ is low, There's a high resistance and no current.\nIf $V_{gate}$ is high, there's a low resistance and so current flows.\n\nThere's also a PMOS transistor setup, which is the opposite.\n![7f013293.png](7f013293-kl2ssw7p.png)\n\nThe difference is the transistor substrate: PMOS is P-doped while NMOS is N-doped. It should be noted that at times we have **weak signal**, where the analog value is in between our High and Low voltage. The different transistors have weak signals at different points. To combat this, we introduce the CMOS:\n![512018fa.png](512018fa-kl2ssw7p.png)\nA | $Q_1$|$Q_2$|F\n---|---|---|---\n0|Low|High|1\n1|High|Low|0\nCMOS has very low power consumption (leakage and transition), and it's simple.\n\n![1bd466bd.png](1bd466bd-kl2ssw7o.png)\n\nTo reason out these circuits, think of the states of the transistors based on their gate voltage. Then, connect paths. The output $Z$ will have a direct connection to either 5V (HIGH) or Ground (LOW).\n\n![531fac3b.png](531fac3b-kl2ssw7p.png)\n\n![34cd1bbc.png](34cd1bbc-kl2ssw7o.png)\n\nThe NAND gate is cheaper when compared to the AND and OR. NAND has fewer transistors.","tags":[],"folderPathname":"/imported/CS251","data":{},"createdAt":"2020-05-20T15:17:21.141Z","updatedAt":"2020-08-14T17:46:23.918Z","trashed":true,"_rev":"wy20Xqpy62r"}