{"_id":"note:bULXicom6Jw","title":"Module 05: Possibilities, preferences, and choices.","content":"## Module 05: Possibilities, preferences, and choices.\n\n### Consumption Possibilities:\n\nRecall the budget line. Mathematically, the budget line corresponds to the equation:\n$$\nExpenditure = Income\n$$\nLet's consider the Movie and Pop example from before, with Lisa. The equation is as follows:\n$$\nP_PQ_P + P_MQ_M = M\n$$\nWhere $M$ is Lisa's income. $P$ is for price, $Q$ is for quantity.\n\nWe can rearrange the equation to be in intercept-slope form:\n$$\nQ_P = \\frac{M}{P_P} - \\frac{P_M}{P_P}Q_M\n$$\n$\\frac{M}{P_P}$ is lisa's **real income** in terms of pop.\n$\\frac{P_M}{P_P}$ is the relative price of Movies to Pop, which is the slope.\n\n![6ed14963.png](6ed14963-kl2t9533.png)\n\n!!! note Real Income\nThe income expressed as a quantity of goods the household can afford to buy.\n!!!\nOf course, we can substitute values into the above equation to get an expression of a line, which is the budget line.\nA change in price affects the slope, and a change of income shifts the budget line. An increase of income results in a rightward parallel shift. A reduction in income results in a leftward parallel shift.\n\n### Perferences and Indifference Curves\n\n!!! note Indifference Curve\nA line that shows combinations of goods among which the consumer is indifferent. Those options are just as good.\n!!!\n\n![fbc7a535.png](fbc7a535-kl2t9534.png)\n\n![3aa50a3a.png](3aa50a3a-kl2t9532.png)\n\nThis could be Lisa's indifference curve.\nWe can also have different levels of preference, resulting in a sort of topographical map. All points along the same curve are equal in terms of preference.\n\nWhen we plot a bunch of different indifference curves, we get a \n## Preference Map\n![61c444dc.png](61c444dc-kl2t9533.png)\n\n![8093cd59.png](8093cd59-kl2t9533.png)\n\n### Marginal Rate of Substitution\n!!! note MRS\nThe rate at which a person is willing to give up good $y$ to get an additional unit of good $x$ while at the same time **remaining indifferent**.\nThis is the derivative of the indifference curve.\nThis can be described as the marginal utility of good $x$ divided by the marginal utility of $y$. \n$$\nMRS = \\frac{MU_x}{MU_y}\n$$\n!!!\nThe **diminishing marginal rate of subsitution** is the tendency for a person to be willing to give up less of a good $y$ to get one more unit of good $x$, if they already have a lot of good $x$. They want to keep a balance.\n\n![0aa740c4.png](0aa740c4-kl2t9532.png)\n\n### Degree of Substitutability\n\nThe degree of Substitutability informs the shape of the Indifference curve.\nIf the goods in question are substitutes, the indifference curve will be less bowed. If the goods are complements, there will be a very pronounced turning point. Below are graphs that show the extremes of each case.\n\n![8c5cd5c5.png](8c5cd5c5-kl2t9533.png)\n\n## Predicting Consumer Choices\n\n!!! note Best Affordable choice\nThe point that is:\n* On the budget line\n* On the highest attainable indifference curve\n* Has an MRS equal to the relative price of the two goods. - this is equivalent to marginal utility per dollar being equal.\n!!!\n\n![35bf7770.png](35bf7770-kl2t9532.png)\n\n### Changes and their effect\nThe effect of a change in price on the quantity consumed is called the **price effect**.\n\n![61f69020.png](61f69020-kl2t9533.png)\n\nEasy stuff really.\n\nAn increase in income usually just means you can get to a higher indifference curve.\n\n![45313c1a.png](45313c1a-kl2t9533.png)\n\n!!! note Substitution effect\nThe effect of a change in price on the quantity bought when the consumer remains on the same _indifference curve_.\n!!!\n![da6e640c.png](da6e640c-kl2t9533.png)\n\n## Decomposition of Price Change\nA price change can **be composed of an _income effect_ and a _substitution effect_.**\n\nYou can think of substitution effect as the result of the relative price change, and you can think of the income effect as the amount of free income gained by the lower price.\n\n![6b3aa2ee.png](6b3aa2ee-kl2t9533.png)\n\n![8b672a46.png](8b672a46-kl2t9533.png)\n\n![0b9dd4be.png](0b9dd4be-kl2t9532.png)\n\nGiffen goods break the law of demand! Because a reduction in price means a reduction of quantity of demand of the good. Hello?\n\n\n### Interesting case: Food stamps\n\nLimiting the possibilities, by introducing something that isn't cash...","tags":[],"folderPathname":"/ECON101-201","data":{},"createdAt":"2020-06-11T13:47:05.576Z","updatedAt":"2021-02-05T15:42:36.748Z","trashed":false,"_rev":"ht7AFoeSSmz"}