{"_id":"note:hmZMzmHWr-","title":"Module 04: Utility and Demand","content":"## Module 04: Utility and Demand\nWe're taking about consumer preferences.\n\n\n!!! abstract Completeness\ngiven bundles of goods $a$ or $b$ a consumer either wants $a$ more than $b$, $b$ more than $a$, or they're indifferent. \n!!!\n\n!!! abstract Transitivity\nIf a consumer likes $a$ more than $b$ and $b$ more than $c$, then it must be the case that the consumer likes $a$ more than $c$.\n!!!\n\nAnd of course, **more is better**.\n![2b59f112.png](2b59f112-kl2t950d.png)\n\n### Consumption Choices\n\nConsumption possibilities: the goods and services that a consumer can afford to buy. (we really needed to define this?)\n\nBudget line: the line that separates what consumers can buy vs what they cannot. (what conbination of goods and services)\n\n![b413135f.png](b413135f-kl2t950e.png)\n\nThe area under the budget curve is called the **opportunity set**, the set of all bundles of goods that can be afforded.\n\nThis is an example of a budget line. The consumer can do anything under this line, but cannot afford to go over it.\n\nThe benefit or satisfaction from consuming a good or service is called **utility**.\n\n!!! note Utility\nThe benefit or satisfaction that an individual gets from the consumption of a good or service. Utility varies per consumer. It's measured as an ordinal value, because it's truly subjective. So consumers **rank** their available options, and the assigned rank is the utility. Note that utility is unbounded above, and the **higher the better**. The unit is called _utils_, which is made up for this notion of utility.\n!!!\n\n**Total Utility** is the total benefit a person gets from the consumption of goods. More consumption usually means more utility.\n\n!!! note Utility Function\n\nThe relationship between the quantity of goods consumed, and utility.\nThese aren't relations that exist concretely during observations, but they can\nbe constructed from many data points.\n\nKeep in mind though, that Utility is an **ordinal measure**, not a **cardinal** one. So it doesn't really make sense to compare 23 utils to 14 utils.... We can say that 23 utils is preferable to 14, but not by how much, really.\n\n![1b55dd0c.png](1b55dd0c-kl2t950d.png)\n\n!!!\n\n**Marginal Utility** is the change in total utility that results from a unit increase of quantity of the good consumed. Generally, as the quantity of the good increases, the marginal utility decreases. This is the principle of **diminishing marginal utility**.\n\n![9877ae04.png](9877ae04-kl2t950d.png)\n\nThere is actually a situation where the total utility reaches a maximum value, and the marginal utility is zero. What's the point of having more movies than you can watch in your lifetime? Or more cantelope than you can eat before it all goes rotten? These additional goods do not increase your  total utility.\n\n### Utility-Maximizing Choice\nThe key assumption is that a **household chooses the consumption possibility that maximizes total utility**.\n\nTo find this choice, there are a few techniques. One is to find all the \"Just-affordable\" combinations, and compare their utilities. The one with the highest utility score wins!\n\nThis ideal combination is called **consumer equilibrium** - when a consumer has allocated all of their available income in the way that maximizes their utility.\n\n#### Choosing at the Margin\nWould spending one dollar more or a dollar less on a good bring more total utility?\n\n!!! note Marginal Utility per dollar\nThe marginal utility from a good, divided by its price. Given a good M, this can be calculated as:\n$$\\frac{MU_M}{P_M}$$\n\nRemember that this is completely marginal. The price is the price of 1 unit, and the MU is the marginal utility gained from the consumption of one more of that good.\n!!!\n\nThis leads us to a second way in which we can find the utility-maximizing choice: \n* spend all available income\n* **Equalize the marginal utility per dollar for all goods**\n\n![dde4bd9e.png](dde4bd9e-kl2t950e.png)\n\n\n#### Utility is maximized when the marginal rate of substitution equals the marginal rate of transformation (relative price)\nThat is, **the slope of the budget line equals the slope of the indifference curve**. The two are tangent, which implies that the maximum utility curve has been met.\n\nMarginal rate of substitution is the number of good Z someone will give up to receive the number of goods B.\n\n$$\nMRS = \\frac{\\Delta B}{\\Delta Z} = - \\frac{MU_Z}{MU_B}\n$$\n\n$$\nMRT = - \\frac{p_z}{p_b}\n$$\nIt's the slope of the of the indifference curve, if Z is on the $x$ axis.\n![2b9e8eee.png](2b9e8eee-kl2t950d.png)\n\nAgain, MRS should always be negative, but economists are not good at putting signs in front of their equations.\n\n![a691894b.png](a691894b-kl2t950d.png)\n\nThere's also a **corner solution**, where consumers only buy one type of good. So watch out for that:\n\n![7a2cd618.png](7a2cd618-kl2t950d.png)\n\nAlso there are some really odd cases for odd preference curves.\nRather have one bigger house than two smaller ones.\n\n![2ad4f0e7.png](2ad4f0e7-kl2t950d.png)\n\n---\n\n### A fall in price\n\nWhen the price falls, the point on the demand curve moves down and to the right; there is more demand. Also, the marginal utility per dollar increases, because the price decreased. To restore consumer income, the quantity consumed of the now cheaper good will be increased, and the demand for all other goods will decrease. The following charts show what would happen if the price of movies decreased: \n\n![dd4b1f16.png](dd4b1f16-kl2t950e.png)\n\nContrast this with the above chart, in which movies were $8 each.\n\nThe consumer acts to equalize marginal utility per dollar among all goods, so we expect an increase in the purchasing of movies. Because a consumer's income is fixed, we expect an increase in the quantity demanded of movies, and a decrease in the quantity demanded of movies.\n\n![402c4cf6.png](402c4cf6-kl2t950d.png)\n\nOf course, these are simply predictions, and not guaranteed to happen. They're good predictions though...\n\nYou can imagine what would happen with an increase of price. The quantity demanded would decrease, and less of the good would be purchased, with other goods now having a relatively higher marginal utility per dollar.\n\nNow, if **income** increases, the demand for all normal goods increases. Our budget line simply moves out.\n\n**The paradox of value** refers to the facts of **low prices for abundant necessities** and **high prices for rare luxuries**. Really, food is kind of the highest utility, because it's required for life. It is of the highest value, and yet is has some of the lowest price.\n\n![f841cca6.png](f841cca6-kl2t950e.png)\n\n!!! note the Endowment Effect\nThe tendency for people to value something more highly because they own it. The instinctive unwillingness to trade, even if the trade is in their favour. People like to keep what they have.\n!!!\n\n!!! note Neuroeconomics\nThe study of the activity of the human brain when a person makes an economic decision. Some decisions are made with the pre-frontal cortex, while others are made with the hippocampus. (yeah I know that's not how the brain works).\n!!!","tags":[],"folderPathname":"/ECON101-201","data":{},"createdAt":"2020-06-02T23:25:56.805Z","updatedAt":"2021-02-05T15:28:44.444Z","trashed":false,"_rev":"Zr5Bf9VGlx"}