{"_id":"note:KfDcrm7zDwi","title":"Early Picasso, part 2","content":"# Early Picasso, part 2\n\n![be1445a8.png](be1445a8-kl2t955i.png)\n\nDidn't consider it finished, stopped working on it in 1907, he only showed it in 1937.\n\nIt's a departure from his usual work. It's a firm departure from traditional painting, and Picasso's Blue and Rose period. Now he's **concentrating on perception and the physical world**. Figures in a space. \n\nThe title refers to the red light district in barcelona. Probably prostitutes.\n\n![3abbb010.png](3abbb010-kl2t956l.png)\n\nThis is a early study of the work.\nThe men are sailors, because Barcelona was a big port. \nHe painted from memory :smirk:.\n\n![d0cbc3ab.png](d0cbc3ab-kl2t95w2.png)\n\nanother study\n\n![29590d2d.png](29590d2d-kl2t955l.png)\n\nnow with no sailors.\n\nIt gets removed from the work, only exists in the Title.\n\nThere are _hundreds_ of sketches of this work. He worked on it for 2 years.\nHe's being consistent with traditional academic painting in his many drafts and studies.\n\nIt's pretty Cezanne. He builds upon Cezanne. The figures are broken down into planes, kind of like _passage_. It's like multi-perspective object perceptions.\n\nColour is flesh tone of course. But it's also used to seperate planes. There's a vitality to the work, an energy. The figures become more and more complicated. the middle ones, then the left, then the right. Middle ones are less abstract, the right ones are absolutely wild.\n\n![44653970.png](44653970-kl2t9535.png)\n\nHim vibing in his study. He's bought a lot of African objects, maybe some from Oceania. It was new, he was interested. You actually don't need a lot of detail to convey essence. The \"primitive\" art really demonstrates that.\n\nBack to the painting...\n\n![9a674cc0.png](9a674cc0-kl2t955i.png)\n\n\nIt's about how the figures exist in space.\nOf course, it's not 1 point perspective, it's not 2 point perspective, it's not 3 point perspective. We can't use _perspective_. He's fragmenting space. You have to think about them in space. The space is as volumetric as the figures.\n\nThe space is as important as the objects. Blows away the idea of \"dead space\".\nSpace is living, breathing, volumetric.\n\nHe throws in a still life, just to be funny. Because he's exploring painting in a whole new way.\n\n\n![1adb1ae4.png](1adb1ae4-kl2t953q.png)\n\nGeorges Braque responded to the painting. He hated it. But he had to acknowledge the exploration it was doing.\n\n![b4fa4ae0.png](b4fa4ae0-kl2t95w2.png)\n\nThis is a work of his, before he saw _Demoiselles d'Avignion_.\n\nAfter, he does these:\n\n![08a89d6d.png](08a89d6d-kl2t955k.png)\n\n---\n\nPicasso and Braque went past, and into landscapes. It's really hard, because of the huge space.\n\n![24a2fafe.png](24a2fafe-kl2t953q.png)\n\n![e8f43b1c.png](e8f43b1c-kl2t955k.png)\n\nl'Estaque is where Cezanne painted.\n\nBoth are shifting to monochromatic earth tones. Rejecting the expressive power of colour, to concentrate on form and space. \n\n![d41b1428.png](d41b1428-kl2t955j.png)\n\nThese painters would later be known as the _Cubists_. Matisse saw the paintings and expressed that they were composed of small cubes. The Fauvism art critic, and described Braque's work as a \"reduction to cubes\". And that's where Cubism comes from. Way beyond Cezanne.\n","tags":[],"folderPathname":"/FINE112","data":{},"createdAt":"2021-02-12T20:14:16.655Z","updatedAt":"2021-02-12T20:57:08.415Z","trashed":false,"_rev":"mpowJgF9SkO"}