{"_id":"note:ldcmmoq5FFA","title":"Unit 05: Differentiable functions","content":"## Unit 05: Differentiable functions\n\nPartial derivatives are not enough to satisfy the concept of differentiability. Whereas partial derivatives are closely related to cross-sections, differentiability can be closely related to linear approximation and tangent planes.\n\nFirst, let're recall what it takes for a function in 1 dimension to be differentiable:\n\n![d8be05e1.png](d8be05e1-kl2t9534.png)\n\nNow, contrast this with the very similar definition in multiple definitions:\n\n![33123211.png](33123211-kl2t9534.png)\n\nSo you see that they both involve good linear approximations. For the mult-variate case, there's a cool little theorem here that lets us grab the values of the partial derivatives at the limit point, if we already have the linear approximation:\n\n![cf60c41c.png](cf60c41c-kl2t9534.png)\n\n!!! danger Differentiability common error\nFor there to be a linear approximation, both partial derivatives must exist at $(a, b)$. However, **both partial derivatives existing does not guarantee that the function is differentiable at $(a,b)$.** So existance is necessary, but not sufficient.\n!!!\n\nAdditionally, you can think of differentiability as \"is the tangent plane a good approximation for the function, and does the error get smaller and smaller as we approach the limit point?\".\n\n### A better definition for the tangent plane:\n\n![1b6a1784.png](1b6a1784-kl2t9534.png)\n\nAnd now we have an important theorem, proved by the Mean Value Theorem:\n\n![96224ba6.png](96224ba6-kl2t9534.png)\n\nImportantly, the converse is not correct. If $f(x,y)$ is differentiable at $(a,b)$, that does not imply that $f_x$ and $f_y$ are both continuous at (a,b).\n\nThese implications can get pretty confusing, so here is a diagram:\n\n![47cef943.png](47cef943-kl2t9534.png)\n\n","tags":[],"folderPathname":"/MATH237","data":{},"createdAt":"2020-06-05T16:53:57.700Z","updatedAt":"2020-08-10T14:08:11.575Z","trashed":false,"_rev":"HmV2LTUl47u"}