{"_id":"note:nvKg3OgNklw","title":"Module 03.5: Government intervention","content":"# Module 03.5: Government intervention\n\nWe'll be covering government taxation, quotas, etc.\n\n!!! note Quota\n\nThe limit that a government sets on the quantity of a foreign-produced good that may be imported. So we can't be flooded with foreign goods.\n\n!!!\n\n!!! abstract Licensing Laws\n\nA limit of the number of firms that may sell goods in a market. LLBO, for example.\nOr taxi cabs.\n\n!!!\n\n!!! note Price Ceilings\n\nThe price can't be above this amount.\nThis would have no affect if the equilibrium price is lower than the value.\n!!!\n\n!!! note Price Floors\n\nThe price can't be **below** this amount.\nThis would have no affect if the equilibrium price is higher than the value.\n\nMinimum wage is a Price Floor on Labour.\n\nBut of course, if mimium wage is above equilibrium, there's persistent unemployment, because there's a lack of demand.\n\n![9a756919.png](9a756919-kl2t9534.png)\n!!!\n\n\n## Sales Tax\n\n!!!abstract _Ad Valorem_ Tax\nFor every dollar spent, the government keeps a fraction, $\\alpha$. This is like HST in Ontario.\n!!!\n\n!!! abstract Unit Tax\nA fixed tax on every unit sold. This tax is easier to analyze, and it has the same affect as _Ad Valorem_.\n!!!\n\n#### It doesn't matter if the consumers or producers pay the tax; the equilibrium price shifts all the same, and the end result is the same.\n\n!!! abstract Incidence of Tax on Consumers\nthe share of the tax that falls on consumers.\n\n![8496bf5e.png](8496bf5e-kl2t9534.png)\n\nHere, $p$ is price, $\\tau$ is tax, $n$ is the elasticity of supply (pre-tax),\nand $\\epsilon$ is the elasticity of demand (pre-tax).\n\nRemember, $\\epsilon < 0$, so the Incidence is always between 0 and 1.\n\nIf demand is perfectly elastic, then this incidence is effectively 0; the suppliers pay all the tax. However, if demand is perfectly inelastic ($\\epsilon = 0$), then consumers end up paying all the tax.\n\n!!!\n\n![ab42bd87.png](ab42bd87-kl2t9535.png)\n","tags":[],"folderPathname":"/ECON101-201","data":{},"createdAt":"2021-02-01T18:14:31.217Z","updatedAt":"2021-02-01T19:09:17.904Z","trashed":false,"_rev":"cG--Pyf-1Xi"}