{"_id":"note:O1FZWJKtcVo","title":"Module 01: Economic Coordination","content":"# Module 01: Economic Coordination\n## Economic Coordination\n\nThere are two major forms of economic coordination: **central economic planning** and **decentralized economic planning**. In the west, we're more decentralized. However in China, they are more centralized.\n\nIn this course, we'll focus on decentralized economic planning.\n\n### The Circular Flow in the Market Economy\n\n![7eee9893.png](7eee9893-kl2sswa8.png)\n\n\nA **firm** is an economic unit that hires factors of production and organizes those factors of production to produce and sell goods or services.\n\n!!! note Factors of Production\n\n1. Land\n2. Labour\n3. Capital\n4. Entrepreneurship\n!!!\n\nA **household** can be defined as an economic unit of one or more persons that provides the economy with resources. A household also aims to satisfy some of their human wants by purchasing goods and services with money.\n\n**Prices** within markets coordinate the firms’ and households’ decisions.\n\nThis is a very high level view of the economy, with no government or other nations. However, it's a good start.\n\n## Production Possibility Frontier (PPF)\n\nLet's say we have a market, where all other things are constant except guns and butter. (WTF)\n\n\n![](screenshot-from-2020-05-14-10-16-14.png)\n\nThe boundary here is set by the scarcity of resources. Production is only efficient on the frontier. Points inside the boundary are inefficient.\n\n![5719b7d2.png](5719b7d2-kl2sswa7.png)\n\nOpportunity cost changes as you walk along the frontier. A linear PPF indicates a constant opportunity cost.\n\n$\\text{Opportunity Cost}= \\frac{What we give up}{What we get}$, but never use this definition mathematically.\n\nOpportunity cost is the slope of the PPF. It's always negative, but economists always document it as positive.\n\n!!! note Marginal Cost\nThe opportunity cost of producing one more good or service.\n!!!\n\n!!! note Marginal Benefit\nThe benefit received from consuming one more unit of a good or service.\n\"Law of deminishing returns\" dictates that this has a negative slope.\n![9a9f72dd.png](9a9f72dd-kl2sswa7.png)\n\n!!!\n\n\n**Allocative Efficiency** occurs on the point on the PPF where the marginal benefit curve equals the marginal cost curve.\n\n![ec0ee026.png](ec0ee026-kl2sswa8.png)\n\nNow, how do we advance the frontier?\n* Technological advancement\n* Capital accumulation\n\nGrowth comes at the cost of current consumption.\n\n## Specialization and Trade\nA person has a **comparative advantage** in an activity if that person can perform the activity at a **lower opportunity cost** than anyone else. A person cannot have a comparative advantage in all activities.\n\nA person has an **absolute advantage** if that person is more productive than others.\n!!! caution Example\nLet's take Apple computers and Brother. Apple computers could probably start producing printers, and they would be better at it than Brother. They're just a more productive firm; they have and absolute advantage. But should they just pivot and become a printer company? NO! Because then they would be giving up their computer and phone business, which is much more profitable. So while they have the absolute advantage, their opportunity cost when producing printers is way higher; they're giving up making phones and computers. Brother isn't good at doing anything but making printers. Even though in total they're less productive, they have the comparative advantage over Apple because they're **giving up less**.\n!!!\n\nYou should specialize if you have a **comparative advantage**.","tags":[],"folderPathname":"/imported/ECON101-201","data":{},"createdAt":"2020-05-19T20:32:37.171Z","updatedAt":"2020-08-09T13:24:33.738Z","trashed":true,"_rev":"v60hJ7jUw8Y"}