{"_id":"note:Qr6LPgs9Pg","title":"Module 11: Monopolistic Competition","content":"# Module 11: Monopolistic Competition\n\nA market structure in which a large number of firms compete\n\n1. each firm has a small share of the market\n2. No firm can dictate market conditions\n3. Collusion between all firms is not viable, so in general it isn't viable.\n4. Firms are independent of each other\n\n!!! abstract Collusion\nThe illegal cooperation of conspiracy to cheat or deceive others. It can occur when firms restric output in order to set the price higher than the equilibrium price.\n!!!\n\nIt's too challenging to coordinate collusion between many firms.\n\nIn a monopolistic competitive market, each firm produces **differentiated product**. \nThis is a **key feature**, because it means that no demand is perfectly elastic, and **the firms are not price takers**. There often isn't that much price competition, more product competition and marketing competition.\n\nThe differences can be actual differences, or simply perceived differences. Apple vs Samsung lmao. Apple phones aren't actually better, but people are convinced.\n\nKetchup is a Monopolistic Competitive market.\n\nSo obiously, **advertising** is a big deal.\n\nProduct differentiation lets firms compete in three areas:\n* Quality\n* Price\n* Marketing\n\nGUCCI baby. Marketing and quality have a lot of influence.\n\nMonopolistic competition allows firms to enter and exit the market \"freely\". It's not free, but there isn't much barrier to entry.\n\n![881458f0.png](881458f0-kl2ssw7o.png)\n\nJust like in perfect competition, there is no economic profit to be had in the long run. \n\n---\n\n### The firm's short-run output and price decision\n\nThe firm outputs at $MR = MC$.\n\nPrice is determined frome the demand for the firm's product and is the highest price that the firm can charge for the profit-maximizing quantity.\n\n\n![6d1bb2bc.png](6d1bb2bc-kl2ssw7n.png)\n\nThere could also be a loss:\n![8ac69b85.png](8ac69b85-kl2ssw7n.png)\n\nBut remember, in the long run, economic profit produces entry. So, eventually there will be zero economic profit.\n\n![f6da0c65.png](f6da0c65-kl2ssw7o.png)\n\nSo the key differences between monopolistic competition and perfect competition:\n* Excess capacity - if it produces less quantity at which $ATC$ is a minimum.\n* Markup = the amount by which its price exceeds its marginal cost.\n\nIn the long-run, firms produce less than the **efficient scale**, which is the quantity at which $ATC$ is a minimum.\n\nThey operate at **excess capacity**, because it maximizes profit.\n\n\n![193eebeb.png](193eebeb-kl2ssw7n.png)\n\nIn contrast, firms in perfect competition have no excess capacity or markup:\n\n![dcee7353.png](dcee7353-kl2ssw7o.png)\n\nThis means that **monopolistic competition is not economically efficent** because the firms produce less than the efficient quantity.\n\nThe markup arises from product differentiation.\nPeople value product variety, but it costs them more. Socially, the loss that arises excess capacity is offset by the gain that arises from having more product variety.\n\n---\n\n## Product Development and Marketing\n\nTo keep making economic profit, a firm must be in a state of continuous product development. This allows the firm to gain a competitive edge, if only temporary.\nInnovation is costly, but it increases total revenue.\nOf course, firms pursue R&D until the marginal revenue from innovation equals the marginal cost of innovation.\n\nThe amount of product development is efficient if the marginal social benefit (amount the consumer is willing to pay for the innovation) from the innovation equals the marginal social cost that the firms incur to make the innovation.\n\n### Advertising\n\nAdvertising a product increases cost, and changes demand (hopefully increasing it).\n\n![b6c2ce90.png](b6c2ce90-kl2ssw7o.png)\n\nSo the change in demand can actually cause lower costs, because the firm can witness economies of scale.\n\nHowever, advertising may also shrink markup. The below graphs show this, before and after advertising:\n![b0c3b1f4.png](b0c3b1f4-kl2ssw7o.png)\n\n![da32ba62.png](da32ba62-kl2ssw7o.png)\n","tags":[],"folderPathname":"/imported/ECON101-201","data":{},"createdAt":"2020-07-23T15:48:24.851Z","updatedAt":"2020-08-10T21:07:33.586Z","trashed":true,"_rev":"Xfyrb3iR-v"}