{"_id":"note:qzDYPqo1K9D","title":"Module 08: Efficiency and Equity","content":"# Module 08: Efficiency and Equity\n\n## Resource Allocation methods\n\n!!! abstract Allocation through market price.\nPeople who are willing and able to buy a resource get the resource. There's a market price, which balances supply and demand.\n!!!\n\n!!! abstract Allocation through Command System\nAllocates resources by the order of someone in authority. This is like a boss telling you how to spend your time.\nThis is difficult to implement in an entire economy. How can you micromanage every transaction? Well, North Korea, Cuba, and China can do it. It's a centralized market plan.\n!!!\n\n!!! abstract Allocation through Majority Rule\nAllocation is determined by some democratic process, like how a government in Canada allocates tax dollars. This system is pretty good, but some minorities can fall through the cracks.\n!!!\n\n!!! abstract Allocation by Contest\nMaking a competition, and allocating resourses based on performance.\nThis is like when an employer offers a top prize for achieving the most sales in a year. This system works well when the efforts of the players in the contest are hard to monitor and reward directly.\n!!!\n!!! abstract First-come, first-served\nResources are allocated to those who come first in a line. This is common in supermarkets, checkouts, restaurants. When people can only be served one at a time, or few at a time, this seems like the only way.\n!!!\n\n!!! abstract Lottery Allocation\nChoosing straws. This isn't as uncommon as you would think. Provincial lotteries reallocated millions of dollars in this way. This system is also used to determine places in a marathon start, for example. These systems are good for when there's no good way to distinguish among potential users of a scarce resource.\n!!!\n\n!!! abstract Allocation according to Personal Characteristics\nMarriage partners is about the only good use of this allocation. A lot of discrimination and specifically racism comes from this point.\n!!!\n\n!!! abstract Allocation by Force\nWar, Theft, for resources. But also laws, and taxation. Taxes effectively transfers wealth from the rich to the poor, through the force of law.\n!!!\n\nAn individual demand curve is the relationship between quantity demanded and the price of a good or service for a single individual. A market demand curve is the sum of individual demand curves by all individuals at each price. It's summed horizontally remember; the quantity demanded just goes up.\n\nThe market demand curve is also called the marginal social benefit curve or **MSB**.\n\n**Consumer Surplus** is when we buy a good or service for **less than it is worth to us**. It's the **AREA UNDER THE DEMAND CURVE**, but above the price consumers must pay for the good.\n\n![068d564e.png](068d564e-kl2t950p.png)\n\n![59f2e816.png](59f2e816-kl2t950p.png)\n\n\n---\n\nSimilar concepts exist for Producers.\n\nThe market supply curve is the marginal social cost curve or **MSC**. It's the horizontal sum of all the supply curves of the individual producers.\n\n![664569bf.png](664569bf-kl2t950q.png)\n\n![119a1be3.png](119a1be3-kl2t950p.png)\n\n### Competitive Equilibrium and Efficiency\n\nMSB = Marginal social benefit curve = market demand curve\nMSC = Marginal social cost curve = market supply curve\n\nTotal surplus = sum of consumer surplus and supplier surplus.\n\n![cba334a9.png](cba334a9-kl2t950q.png)\n\n![56852a0a.png](56852a0a-kl2t950p.png)\n\n---\n\nA **market failure** is when a market does not produce an efficient outcome, which occurs from the under or over-production of a good or service.\n\n![b105d5da.png](b105d5da-kl2t950q.png)\n\n![e6c54e93.png](e6c54e93-kl2t950q.png)\n\nIn either case, society suffers. Either society can't get the goods they want in the quantity they want, or resources are being wasted in overproduction and they would be better off spending those resources elsewhere.\n\nSo what causes a market failure?\n\n!!! caution Price and Quantity Regulations:\n**Price regulations** that limit the max price that firms can charge can lead to underproduction.\n**Price regulations** that limit the minimum wage workers can be paid can put a block on the equilibrium price adjustments and lead to unemployment (overproduction in labour?)\n**Quantity reglations** that limit the amound that a firm is premitted to produce can lead to underproduction.\n!!!\n\n!!! caution taxes and subsidies\nTaxes increase the prices paid by buyers, and lower the prices received by sellers. so taxes decrease the quantity produced, and can lead to underproduction.\n\nSubsidies lower the prices paid by buyers and increase the prices received by sellers. They can increase the quantity produced and cause overproduction.\n!!!\n\n!!! caution Externalities\nAn externality is when the economic actions of one individual (or a group) directly affect the economic outcomes of another individual.\n\nAn electric utility, for example, creates an external cost on the environment by burning coal. The firm **doesn't consider this cost** when it chooses the quantity of power to produce. Overproduction of electricity follows since the external costs are ignored.\n\nExternal benefit is a benefit not considered. Your neighbour would benefit from you installing a smoke alarm. However, this is not considered, leading to underproduction.\n\nThere are deadweight losses if you don't consider all the factors, all the costs, all the benefits.\n!!!\n\n### Public Goods and Common Resources\n\nA **public good** is a good or service that is consumed simultaneously by everyone even if they don't pay for it, like streetlights. However, there's an underproduction if there are too many free-riders. For example, if a city offers free public transport, they'd probably send out fewer buses because everyone on the bus is a free-rider, and a lot of them are probably under the tax bar, so they're not paying for the service even indirectly. Or if you watch fireworks without paying an entrance free, you're a free loader. If you donate, then maybe there would be more fireworks, and less underproduction.\n\nA **common resource** is owned by no one but can be used by everyone.\nThe issue is, it's in everyone's self-interest to ignore the costs of using the common resource. This is called _the tragedy of the commons_, and it leads to overproduction. Like the overproduction of Cod in newfoundland.\n\n!!! caution Monopoly\nA **monopoly** is a firm that is the sole provider of a good or service.\nA monopoly leads to higher prices and underproduction\n!!!\n\n!!! caution High transactions costs\nThe opportunity cost of making trades in the market. This might create underproduction, for obvious reasons\n!!!\n\n---\n## But is it fair?\n\nIt depends if you care that **results** are fair, or if the **rules** are fair.\n\n### Fair Results View\n\nThe utilitarianism stance.\n\n![38f93f57.png](38f93f57-kl2t950p.png)\n\nEquity. Tax the rich, give to the poor. Make sure the marginal benefit of all the dollars is maximized. But of course this is a (small) deterrent to working more hours, so it's possible that less gets produced.\n\nSo we reduce the size of the pie, but share it more equally. A competitive market equilibrim is not fair based on this utilitarianism principle.\n\n### Fair rules view\n\nThis is the symmetry principle, where people in similar situations should be treated similarly. So equal opportunity. University classes is fair rules; all students have equal opportunity.\n\nSo then the competitive market equilibrium is theoretically fair? It depends on how you view it, and this debate has been going on forever.\n\n","tags":[],"folderPathname":"/ECON101-201","data":{},"createdAt":"2020-07-02T18:14:13.705Z","updatedAt":"2020-08-09T18:50:04.723Z","trashed":false,"_rev":"kPqbfYozgnt"}