{"_id":"note:RbKgEnoh3i8","title":"Module 12: Oligopoly","content":"## Module 12: Oligopoly\n\nThis is when:\n\n1. Natural or legal barriers prevent the entry of new firms\n2. A small number of firms compete\n3. Each firm is an oligopoly is aware of the actions of other firms and acts strategically\n\na _duopoly_ is when there are only two such firms.\n\n![4621c4ad.png](4621c4ad-kl2t950x.png)\n\n![17d93ac3.png](17d93ac3-kl2t950x.png)\n\nBecause there are only a few number of firms, they are interdependent and face a temptation to cooperate.\n\nInterdependence means taht each firm's profit depends on every firm's actions.\n\nTemptation to cooperate because they could form a cartel (monopoly?)\n\nA cartel is a group of firms acting together to limit output, raise price, and increase profit.\n\n---\n\nThis has a lot of game theory.\n\nThe games have:\n1. Rules\n2. Strategies\n3. Payoffs - consequences of certain outcomes (the utility to each player in the end)\n4. Outcomes\n\n## The prisoner's dilemma\n\na classic.\n\nThis introduces the Nash Equilibrium. It's the mutual best response regardless of the opponent's response. In the prisoner's dilemma, the nash equilibrium is that they both confess, however that's a suboptimal outcome, hence the dilemma.\n\n![df2fd4d3.png](df2fd4d3-kl2t950y.png)\n\n---\n\nA collusive agreement is one in which two firms restrict output, raise the price, and increase profits. Such agreements are illegal in Canada.\n\nHowever, this is actually a prisoner's dilemma, because breaking the agreement would increase profits further.\n\nWhen in a cartel, the cartel acts like a monopoly.\n\n![9bef6395.png](9bef6395-kl2t950x.png)\n\nBut here's the dilemma:\n\n![98ff0f04.png](98ff0f04-kl2t950x.png)\n\nBut if they both cheat:\n\n![4abf5e03.png](4abf5e03-kl2t950x.png)\n\nIt's a perfectly competitive market.... There's no profit in the long run.\n\nThe nash equilibrium is in cheating, just like the prisoner's dilemma. So collusion usually fails.\n\nThere's also a game of chicken in R&D:\n\n![f569edc9.png](f569edc9-kl2t950y.png)\n\nOf course, the two firms can also reach a cooperative equilibrium.\n\n![f1511ae3.png](f1511ae3-kl2t950y.png)\n\n---\n\n## The law\n\nThere are laws against cartels obviously:\n\n![cd05b21e.png](cd05b21e-kl2t950y.png)\n\nNon-riminal activities include:\n1. Mergers\n2. Abuse of dominant position\n3. Exclusive dealing\n\n\n![363ce181.png](363ce181-kl2t950x.png)\n\n![86d2d427.png](86d2d427-kl2t950x.png)","tags":[],"folderPathname":"/ECON101-201","data":{},"createdAt":"2020-07-29T22:57:05.205Z","updatedAt":"2020-07-30T00:07:52.207Z","trashed":false,"_rev":"BrbCiRuKsrW"}