{"_id":"note:TabsVk-0tIf","title":"Module 03: Elasticity","content":"# Module 03: Elasticity\n## Introduction to Elasticity\n!!! note Elsasticity of Demand\nThe units-free measure of the responsiveness of the quantity demanded of a good to a change in its price when all other influences on buying plans remain the same.\n$$\n\\frac{\\text{Percentage change in the quantity demanded}}{\\text{Percentage change in the price}}\n$$\n$$\n\\epsilon_D = \\frac{\\frac{\\Delta Q}{\\text{average Q}}}\n{\\frac{\\Delta P}{\\text{average P}}}\n$$\nThe averages are the average of the old and new price.\n\nIn calculus, it's \n$$\n\\epsilon_D = \\frac{dQ}{dP} \\times \\frac{P}{Q}\n$$\nBe careful; that's the **inverse** of the derivative. We're looking at what a change in price does to the quantity demanded, so it's the inverse of the derivative.\n\nIf we have the demand curve as $Q = a - bp$ where $p$ is the price, then\n$\\epsilon_D = \\frac{dQ}{dp}\\frac{p}{Q} = -b \\frac{p}{Q}$.\n!!!\n\n![bd210ade.png](bd210ade-kl2ssw7v.png)\n\nElasticity of demand **will always be negative**, because the slope of the demand curve is always negative. However, it's often represented as positive (SMH).\n\n(Unless Giffen goods - goods where people prefer higher prices.)\n\n\nIf the quantity demanded doesn't change when the price changes, the price elasticity of demand is zero and the good has a **perfectly inelastic demand**.\n**Unit elastic demand** is when $\\epsilon_D =-1$. This occurs when the demand curve is linear, at the center quantity demanded, or when the demand curve is curved away from the origin... ??\nGenerally, we say that demand is **inelastic** when $|\\epsilon_D| < 1$, **elastic** when $|\\epsilon_D| > 1$.\n\n**Perfectly Elastic Demand** occurs when $\\epsilon_D = -\\infty$. This means that when the price barely changes, the change in quantity demanded changes dramatically.\n\n![f57639c8.png](f57639c8-kl2ssw7v.png)\n\nElasticity of demand depends on the following:\n\n- **The closeness of substitutes**: the closer the sub, the more elastic the demand. Necessities, like food and housing, generally have inelastic demand. On the other hand, exotic vacations generally have elastic demand.\n- **The proportion of income spent on a good**: The greater proportion, the larger the elasticity of demand for that good.\n- **The time elapsed since a price change**: The more time consumers have to adjust to a price change, or the longer that a good can be stored without losing its value, the more elastic is the demand for that good. \n\nExtreme cases can be expressed in calculus. Insulin is an interesting case for diabetics; essential good up to the price that they can afford.\n\n![55447c9a.png](55447c9a-kl2ssw7u.png)\n\n### Total Revenue and Elasticity\n\nIf we want to know how the price affects total revenue, then we need to look at elasticity.\n \n - if the demand is **elastic**, revenue increases if the price decreases. This is because a 1% price cut results in more than a 1% increase in sales.\n - if demand is **inelastic**, a price cut will reduce revenue\n - if demand is **unit elastic**, a price cut of 1% will increase sales by 1%, so revenue won't change.\n \nSo firms want **unit elasticity**. It's what maximizes revenue (square has the largest area)\n![7a2961ef.png](7a2961ef-kl2ssw7v.png)\n \n!!! note Total revenue test\nA method of estimating the price elasticity of demand, by observing the change in total revenue when the price is changed.\nThis test is very helpful for small business owners, who don't have large market information.\n\n\n**When demand is unit elastic, total revenue is maximized.**\n!!!\n\n### Income Elasticity of Demand\n\n!!! note Income elasticity of demand\nA units free measure of the responsiveness of the quantity demanded of a good to a change in **consumer income** when all other influences on buying plans remain the same.\n\n$$\n\\epsilon_M= \\frac{\\frac{\\Delta Q}{\\text{average Q}}}\n{\\frac{\\Delta M}{\\text{average M}}}\n$$\n!!!\nRemember inferior and normal goods? Yeah. When $\\epsilon_M > 1$, the **good is considered normal**, and demand is income elastic.\nIf $0 < \\epsilon_M < 1$, the demand is income inelastic, and the good is still normal.\nHowever, if $\\epsilon_M < 0$, the **good is inferior**.  \n\n## Elasticity of Supply  Exactly what you'd expect.\n!!! note Elasticiy of supply\nThe units-free measure of responsiveness to the quantity supplied of a good to a change in its price when all other influences on selling plans remain the same.\n![1d955c5d.png](1d955c5d-kl2ssw7u.png)\n\nThis value will always be positive, because of the law of supply.\n!!!\n\n![75d7b3c5.png](75d7b3c5-kl2ssw7v.png)\n\nSupply is perfectly inelastic when the supply curve is vertical. elasticity is 0.\n\nSupply is _unit elastic_ if the curve is **linear** and **passes through the origin**. Slope doesn't matter.\n\nSupply is perfectly elastic if the supply curve is horizontal and the elasticity of supply is infinite.\n\n![9ea2face.png](9ea2face-kl2ssw7v.png)\n\n## Cross Elasticity of Demand:\n!!! note Cross Elasticity of Demand\nThe units free measure of the responsiveness of the quantity demanded of a good to a change in the price of a substitute or a complement when all other influences are constant. So there are two different goods, and the price of one impacts the quantity demanded of the other. The ratio of percentages is the Cross Elasticity of Demand.\n\n![c569b55c.png](c569b55c-kl2ssw7v.png)\n\n!!!\n ![87c797c8.png](87c797c8-kl2ssw7v.png) \n \n ### Application of Demand Elasticities\n \n Policy makers\n - Influence of \"sin\" taxes\n - Amount of production reduced to increate price\n\nFarmers\n- Supply management requires inelastic\n\nConsumers\n- Impact of drought/freeze depends on retail price\n\nFood Processors\n- Effect of price change on revenue","tags":[],"folderPathname":"/imported/ECON101-201","data":{},"createdAt":"2020-05-25T19:24:27.171Z","updatedAt":"2021-02-01T18:54:35.419Z","trashed":true,"_rev":"oXblAJr3xGi"}