{"_id":"note:thkksV0-tbh","title":"Module 10: Monopoly","content":"# Module 10: Monopoly\n\n## Monopoly and how it arises\n\nA monopolist is a **price maker**. They control the price.\n\n!!! abstract Monopoly\n* There is only one supplier, and they are protected from competition by a barrier preventing the entry of new firms. This could be a bunch of things.\n* There is no close substitute to the good that they produce. This can be because of geography, technology, patents, or the good is just rare, such as diamonds an gas.\n!!!\n### Barriers to Entry\n!!! abstract Natural Monopoly\nA market in which economies of scale enable one firm to supply the entire market at the lowest possible cost.\n\nThis is when competition is impractical or unworkable. Could you build a company that could compete with Apple? with the Canadian Railroad?\n\nThese natural monopolies mean that it's actually more efficient for a single firm to produce everything. One firm can supply the entire market at a lower price than two or more firms.\n!!!\n\n**Natural** barriers to entry create a **natural** monopoly.\n\n### Ownership Barriers to Entry\n\nOccurs if one firm owns a significant portion of a key resource.\n\n### Legal Barriers to Entry\n\nA legal monopoly is a market is which competition and entry are restricted by law. This includes the granting of a:\n\n1. Public Franchise: Exclusive right to a good or service. Think CanadaPost; they're the only ones who are legally allowed to deliver letters.\n2. Government Licence: Taxicabs, Selling alcohol in restaurants, or medical physicians. The licences are in place to protect consumers from fraud and abuse.\n3. Patent or copyright: Protects the inventor for a period of time, because the inventor had to invest in R&D.\n\n### Monopoly Price-Setting strategies\n\nThere are two main strategies:\n\n1. A single-price monopoly is a firm that must sell each unit of its output at the same price to all its customers.\n2. Price discrimination is the practice of selling different units of a good or service for different prices.\n\n### Price and Marginal Revenue\n\nA monopoly is a price setter. **If it wants to sell more, it must reduce the price.**\n\nFor a monopoly, the marginal revenue is always less than the price at each quantity.\n\n![10ca95e8.png](10ca95e8-kl2t9514.png)\n\n### Marginal Revenue and Elasticity\n\nA single-price monopoly's marginal revenue is related to the elasticity of demand for the good. If demand is elastic, the fall in price brings an **increase in total revenue**. If it's inelastic, then a fall in price brings a **decrease in total revenue**.\n\n![c48d7f14.png](c48d7f14-kl2t9515.png)\n\n![49ea53c8.png](49ea53c8-kl2t9514.png)\n\nSo obviously, a **monopoly doesn't produce in inelastic demand**. That would mean less profits, for more work.\n\n## Price and output Decision\n\nThe firm wants to output the profit-maximizing quantity, where $MR = MC$. It sets the price at the highest level at which it can sell the profit-maximizing quantity.\n\n![9799a173.png](9799a173-kl2t9515.png)\n\n![95bd6cbd.png](95bd6cbd-kl2t9515.png)\n\nFirms can expect to make money, **even in the long run**. Normally, more competitors would be attracted. However, in a monopoly, that doesn't happen. So a monopoly can remain profitable for a long time. Unprofitable monopolies also don't exist; if you can't make money and you're the only supplier, just about nobody can be profitable.\n\n## Single-Price monopoly and perfect competition compared:\n\n![d96c12a7.png](d96c12a7-kl2t9515.png)\n\nSo the monopoly firm has a higher price and produces less, compared to a perfectly competitive market. This usually results in inefficiency.\n\n![d884efc8.png](d884efc8-kl2t9515.png)\n\nYou can see that in perfect competition, the market is efficient. \n\n![a77cf2db.png](a77cf2db-kl2t9515.png)\n\nAnd in a monopoly, the producer surplus expands, and is better than perfect competition. It's also concentrated in a single firm. But there's overall less surplus; it's inefficient.\n\n\n#### Worst-case: Rent Seeking\n\nAny surplus, consumer surplus, producer surplus, or economic profit, is called **economic rent**.\nRent seeking is the pursuit of wealth by capturing economic rent.\nSo it's when someone is trying to get a monopoly status.\nThey can do this by buying more of the surplus (indirectly) or by creating a monopoly by adding barriers to entry and making better products.\n\nHowever, resources used in **rent seeking actions are a cost to society**; they don't really benefit anyone. So, they eat away at the firm's surplus that they already had. They're using their surplus to pursue more surplus. This drives up costs, to a point where they actually have no surplus! This is what Amazon did in the first part of the 21st century.\n\n![aaaa4b88.png](aaaa4b88-kl2t9515.png)\n\n![373e67ad.png](373e67ad-kl2t9514.png)\n\n## Price Discrimination\n\nThis is the sly practice of monopolies charging prices that are closer to buyer's willingness to pay, in order to maximize revenue at no extra cost. For example, airlines will charge business users a different, higher rate. This is because it's probably a business expense that the individual doesn't pay for.\n\nA monopoly can discriminate based upon:\n1. A group of buyers (Adobe charges way more for industry professionals)\n2. Among units of a good (higher quantity discounts)\n\nBy price discrimination, a monopoly takes consumer surplus and converts it into producer surplus.\n\n![53cf196d.png](53cf196d-kl2t9514.png)\n\nTake an airline for example:\n\n![88bdb8b0.png](88bdb8b0-kl2t9514.png)\n\n\n**Perfect Price discrimination** occurs when the firm is able to sell each unit for the highest price someone is willing to pay.\n\n![fa7abd07.png](fa7abd07-kl2t9515.png)\n\nIt's all producer surplus LMAO.\n\n## Monopoly Regulation\n\nObviously, a monopoly can be damaging. So governments try to regulate it.\n\n### Social interest theory\n\nThe **marginal cost pricing rule** is the regulation that sets the price equal to the monopoly's marginal cost. The quantity demanded at a price is equal to marginal cost is the efficient quantity.\n\n![7464cd1f.png](7464cd1f-kl2t9514.png)\n\nBut then the firm suffers an economic loss. How does it get around this while still following the rule? Price discrimination and also one-time fees. This solution is good because it is **efficient**.\n\nThe second option is the **average cost pricing rule**. Basically, the government regulators permit the monopoly to produce the quantity at which price equals average cost. This isn't as efficient, but the firm isn't losing money. The government could also pay the company a subsidy which brings its average cost down to a better level, which increases output and is more efficient. However, it's impossible to know what the firm's true costs are; there would be crazy sketchy accounting. So there are two more actually viable options:\n\n#### Price Cap Regulation\n\nThe price ceiling. This type of regulation give the firm incentive to operate efficiently and keep costs low.\n\n#### Rate of Return Regulation\nA firm needs to justify its price by showing that it's  return on capital isn't too much. In other words, \"we're not making that much money so it's alright\". However, this can cause managers to inflate costs or overreport costs to get more revenue. That would be inefficient.","tags":[],"folderPathname":"/ECON101-201","data":{},"createdAt":"2020-07-15T20:42:52.248Z","updatedAt":"2020-08-14T14:41:39.355Z","trashed":false,"_rev":"q8VEIFpqArg"}