{"_id":"note:TQAU0i2uNbF","title":"VRXPERIENCE Training Day 1","content":"# VRXPERIENCE Training Day 1\n\n### VM Structure\nThere are 6VMs per team on microsoft Azure\n\nThe 3 NV12 Machines are used for VRXPERIENCE **and** SCADE.\nThe 3 DsV2 Machine are used for **SCADE only**.\n\nAll software is pre-installed.\n\nThere are 3 Microsoft Accounts, each with one of each type of VM.\n\nThe NV12 machines have 2 GPUS and are better than the DsV2. They're windows (yuck).\n\nIf two students log into the same VM, they will be using the same remote desktop session. This could be useful for pair programming.\n!!! danger VM Quota\nOf course, shut down the VMS when not in use.\nEach microsoft account allocated to the team has a quota in VM hours, which ticks down whenever the VM is running. Shut it down when not in use to avoid depleting resources.\n!!!\n\n\nSCADE is simply code generation! You can run linux on the vehicle when it comes time. The code is C or C++ so it's agnostic. The simulators are all in windows, however.\n\nWe can't use azure to set up other VMs :/\n\n---\n## Simulation Race Rules\n\nTHe driving simulator will be available only in SCADE. The outputs from sensors and inputs for vehicle control are in SCADE. We can still import code into SCADE. It's being done this way for consistency. Also, we need to directly include our code into the SCADE project, and not import it in a machine-specific way. \n\nThe race will be run in **synchronous mode**.\n\n!!! caution Importantly...\nWhen running the competition, all vehicle parameters will be reset to defaults. So really, we shouldn't modify the params!\n!!!\n\n---\n\n## Simulator Tour\n\n!!! abstract Note\nThis simulator is more than just racing. It looks like it was built for regular driving scenarios for regular AVs. As such, there are a lot of features that aren't applicable to us and can be confusing. Things like traffic lanes and specific intersection rules.\nIf we find odd behaviours, we might have to consider default settings that were put in place for cars on normal roads. That's just something to keep in mind.\n!!!\nThere are 5 main tabs:\n1. Terrain, for editing the track and parameters\n2. Vehicle, for modifying the vehicle model\n3. Scenario, for generating all the dynamic aspects of the scene like other cars and such\n4. Simulation, for running created scenarios\n5. Analysis, for logging.\n\n!!! note Presets\nPresets can be created and found in `C:\\ANSYS\\SCANeRstdio_1.8\\data`.\nAll the data for these simulations is found in this folder. So stuff like car models, track models, scenarios, etc. To import, just drag the files in.\n!!!\n\n### Terrain\n\nTerrain is organized in layers, and is pretty high definition. It sort of looks like AutoDesk software. Movement in 3D space looks very similar to autodesk.\n\nThe official track has **5** lanes defined. The lanes aren't defined on intersections to and from the pits, however. The Egovehicle can **disregard these lanes**. It's more for the other agents, passing other vehicles, and such. It's for controlling automated traffic, for generating scenarios.\n\nThe INDY track is a very high-fidelity recreation of the physical track.\n\nThere are speed limits defined per lane!\n\nWe won't be modifying the terrain because the track is set. However, it's useful for scenario building to be able to create specific environments.\n\n### Vehicle\n\nEach vehicle has a TON of params. Modifying tires, chassis, tires, center of gravity, etc. \nAgain, there's a default vehicle that we'll be using so we won't use this tab much but it would be cool to mess around with it. It can also be useful for generating specific code. Knowing the parameters will come in handy when developing our stack. There are **drag coefficients**. You can even change the gears in the transmission.\n\n### Scenario\n\nThe real meat. Start by dragging in your egovehicle. The standard is `Motorsport_GP2`. The egovehicle **must be vehicle 0** and it must be a \"callas\" vehicle. All other vehicles will be \"simple\" vehicles. A \"callas\" vehicle is doing more computations; it's calculating drag, torques, fuel consumption, etc. Simple vehicles do not do this. We should **use simple vehicles on everything but the ego vehicle to reduce computational burden**.\n\nAn important tab, after double clicking on a vehicle, is the _Driver_ tab. Set the process to \"AQUISITION\" for the ego vehicle, for connecting the AI agent. The rest can be set to \"TRAFFIC\" and the type to \"Traffic driver (autonomous)\" for bots. The best way to turn the traffic bots into race car driver is by setting the \"Norm\" to \"Aggressive\". That way, they'll actually overtake. You also want to change the \"Overtake risk\" super low, so that the agent has no fear and always tries to overtake.\n\nIt's recommended that all the vehicles check the \"Stay on lane\" param in the \"Driver\" tab, such that it doesnt interfere with the egovehicle. It doesn't fight it when trying to overtake etc.\n\n---\n\n#### Scripts\nScripts are a way to control things inside the simulation. It's the way you build complex scenarios. It's completely a GUI, and it looks very annoying. It's a global script, which means if you want to have agents with different actions, you have to specify tasks for each one individually.\n\n!!! caution Python support\nApparently, according to FAQs, you can do the scripting in Python. This is huge!\n!!!\n\nThere are two main types of actions: Target and Obligatory.\nIn target, the agent tries its best to achieve that speed or acceleration or something else. However, it cares about the road laws other vehicles, etc.\nObligatory does not care about any road rules. It will try to get up to speed no matter what. It's a more rogue agent.\n\nThe simulations are deterministic (bruh). The only way to get variation out of the same scripts is to restart the software, which reinitializes the bot's internal neural networks.\n\n---\n\n### Overtaking maneuver","tags":[],"folderPathname":"/imported/WATORACE","data":{},"createdAt":"2020-09-03T14:09:04.867Z","updatedAt":"2020-09-03T18:33:18.417Z","trashed":true,"_rev":"SF-HxPDtsnt"}