{"_id":"note:uqD4bwXICoS","title":"Module 07: Perfect Competition","content":"## Module 07: Perfect Competition\n\n!!! note Perfect Competition\nPerfect competition occurs when:\n*  Many firms sell identical products to many buyers\n* There are no restrictions to entry into the industry\n* Established firms have no advantages over new ones\n* Sellers and buyers are well-informed about prices.\n!!!\n\nUsually, these occur when a firm's minimum efficeint scale is small relative to market demand, so there is room for many firms in the market.\n\nIn perfect competition, firms are **price takers**. If the goods produced are truly perfect substitutes, demand is perfectly elastic and so the firm has no choice but to set the price to the market price. They're at the mercy of the market price; if they go above, then they'll get no sales.\n\n$MR$ is marginal revenue; the revenue made by a one unit increase in the quantity sold. This is a straight line, at the market price. When you sell one more unit, you get the price in revenue\n$TR$ is the total revenue. The slope of this curve is the price, or $MR$. A firm can sell any quantity it produces (that's our assumption).\n$$AVC = \\frac{TVC}{Q}$$\nWhich is the average variable cost.\n\n$$AFC = \\frac{TFC}{Q}$$\nWhich is the average fixed cost.\nSo the only questions that a firm can answer are:\n1. How do we minimize our costs?\n2. What quantity should we produce?\n3. Should we exit the market, or enter it?\n\nObviously, you can plot profit as revenue minus costs and figure out how much a firm wants to produce ideally. What would maximize their profit. \n\n![6174db60.png](6174db60-kl2sswa2.png)\n\nAlternatively, because the marginal revenue is constant (the price is constant), you could look at **marginal revenue and marginal cost over the quantity produced**. You want to produce up until the marginal cost is greater than the marginal revenue. Past this, a firm will only lose money as they produce more. Remember, a firm wants to produce as much as possible, until it stops making money from doing so.\n\n![6982ad4a.png](6982ad4a-kl2sswa3.png)\n\n### The shutdown point\n\n![e7386663.png](e7386663-kl2sswa4.png)\n\n### The firm's supply curve\nA firm's Short-Run Market Supply Curve show the quantity supplied by all firms in the market at each price, all other things remaining constant.\n\n![45bfb071.png](45bfb071-kl2sswa2.png)\n\nNotice that when the price drops below the shutdown point, the firm doesn't care to produce sweaters, hence the flat supply curve.\n\nShort-run market supply and market demand __determine the market price and output__.\nA change in demand causes a change in price and a change in quantity produced.\n\n![7bbbcf29.png](7bbbcf29-kl2sswa3.png)\n\n### Profits and losses in the short-run\n\n![e01369b0.png](e01369b0-kl2sswa3.png)\n\n![84af454d.png](84af454d-kl2sswa3.png)\n\n![565a97d9.png](565a97d9-kl2sswa3.png)\n\nAn economic loss in the short run doesn't mean that the firm should automatically shut down. A firm should only shut down if it believes that the price is lower than the average **variable** cost. If it's below the ATC but above the AVC, the firm will still operate if it feels like the situation is temporary.\n### Entry and exit\n\nInterestingly, the equilibrium for firms in competitive markets is to make **zero economic profit**. If firms are making economic profit, then more firms want to join in. So they do, and then the total market supply goes up. This means that the equilibrium price shifts down, and now all firms are making less profit. But this continues until the whole market isn't profitable for anyone, assuming all the costs are the same for every firm.\n\nNow, if some firms are losing money, they might decide to leave the market, because they're just taking heavy losses. So they leave, the supply curve shifts left, and the market price moves up. Now, all firms are making more revenue. This continues until firms are making 0 profit, at which point no firms really need to leave. Again, this assumes that the costs of production are equal for all firms, which is almost never the case. Really then, it's a competition of \"who can produce the most at the lowest cost\". \nEfficiency is king.\n\n## Changes in demand and supply, and technology\n\nIncrease in demand shifts demand curve rightward, so price rises. Each firm produces more, of course, and firms make money\n\n![eaa5c7a5.png](eaa5c7a5-kl2sswa4.png)\n\nBut then, of course, more suppliers enter the market, it gets less profitable because there's more supply, and then everything comes back to the same price. This can be seen in the below figure.\n\n![ef09b864.png](ef09b864-kl2sswa4.png)\n\nThe opposite happens when demand goes down. In the long-run, it doesn't affect the price. It just affects how many firms are in the market lol. However, in the short run, it does affect profits.\n\n### Tecc\n\nFirms that have a technological advantage have a lower productions cost, and so initially they make a profit. However, when more firms adopt the technology, market supply just increases and the price falls back to long-run equilibrium.\n\nThe aim of the game is **efficiency**.\n\n### The good news\n\nIn competitive markets, consumers end up paying the lowest possible price. Each firm is also very efficient. They maximize value, which is a good thing.\n\n![a9771cab.png](a9771cab-kl2sswa3.png)\n\n![7a7a4e4e.png](7a7a4e4e-kl2sswa3.png)\n\n\n","tags":[],"folderPathname":"/imported/ECON101-201","data":{},"createdAt":"2020-06-18T14:27:42.086Z","updatedAt":"2020-08-09T18:15:10.455Z","trashed":true,"_rev":"zPxk5lhwSV2"}