{"title":"Authentication","content":"# Authentication\n\n:::note MAC\n\nMessage Authentication Code\n\nStill SKES.\nSo it makes sure that the message is from the correct person.\n\n![](image-kkk9u4pv.png)\n:::\n\n![](image-kkk9v2c6.png)\n\n![](image-kkk9xk1y.png)\n\nSo importantly, there's no confidentiality or non-repudiation. So **observers can see the message $x$**. Also, There's **no way for Bob to prove to someone else that the message came from Alice**; that would require letting them in on the key. Bob could have generated the MAC himself anyway. **Bob could fake a message to himself**, as if it came from Alice.\n\nReplay is also something you have to watch out for.\n\n![](image-kkka43mh.png)\n\nSo, to be clear, the attacker can have any message tagged by Alice or Bob, but the attacker has to come up with a tag for any message by themselves, without this \"tagging oracle\". So the attacker can know almost any message-tag pair they want, but they have to derive a new one on their own for the attack to succeed.\n\n![](image-kkka7j7w.png)\n\n![](image-kkka86ih.png)\n\n### CBC-MAC\n\n![](image-kkkacnb8.png)\n\n\n![](image-kkkaeukr.png)\n\n![](image-kkkaf63l.png)\n\n![](image-kkkahd50.png)\n\n\n\n\n\n## V2b\n\n![](image-kkk9f3m8.png)\n\nBut how would we use these for encryption using a key?\n\n![](image-kkk9ho6x.png)\n\n![](image-kkk9idbh.png)\n\nThis one is really just a slight problem. Where if you find a collision, and you find the tag of one (through the tagging oracle), then you can know the tag of the other.\n\nCollisions were found for MD4 and MD5, so the community was very weary of collisions as a potential weakness. As a result, they didn't like this small problem.\n\n![](image-kkkb7f3u.png)\n\n![](image-kkkb843l.png)\nThe constants are arbitrary, but they're fixed and also different.\n\n![](image-kkkbb2b3.png)\n\nHMAC is used in VPNs!\n\n![](image-kkkbco63.png)\n\nSession keys are just \"eggs in different baskets\".\n\n![](image-kkkbe1fa.png)\n\nGSM is not used in between two towers.\n![](image-kkkbfjd8.png)\n\n![](image-kkkbgouz.png)\n\n![](image-kkkbhbd5.png)\n\n![](image-kkkbhlvo.png)\n\n![](image-kkkbiy85.png)\n\n\nBut one drawback of this system is that the providers have to store massive databases of SIM keys.\n\nYou can break into a phone and get a key $k$. Or you could break into the service provider and yoink their database. Or you could go to Gemalto...\n\n![](image-kkkbmweg.png)","tags":[],"folderPathname":"/CO487","data":{},"createdAt":"2021-01-30T21:46:06.258Z","updatedAt":"2021-02-11T15:02:21.685Z","trashed":false,"_id":"note:USF1kL-aF","_rev":"64-c1499012231e3f3a9ae35f58c730deb3"}