{"_id":"note:X1Gj7QierS4","title":"Week 03","content":"### Week 03\n\n!!! note Decoder\nA component that has converts binary to unary. So $110$ to $6$. There are $n$ inputs, $n$ binary digits, and $2^n$ outputs, each corresponding to a value.\n![f6c155bb.png](f6c155bb-kl2ssw7u.png)\nThe implementation of these decoders really just comes down to a bunch of and gates lol. It looks like spaghetti, very grid-like spaghetti.\n!!!\n\nDecoders can be used for Memory Expansion; specifying which blocks of memory to use.\n\n!!! note Multiplexor\nA component with $2^n$ inputs, $n$ _select lines_, and just one output.\nThe select lines choose which input the output should be. We want to choose which input to forward and show as the output. So it could be called a **selector**.\n![4f4d484b.png](4f4d484b-kl2ssw7t.png)\nThe implementation is what you would expect; a lot of ANDs and one OR at the end.\n!!!\n\nThe \"Slash\" notation is used to indicate lines carrying multiple bits, implying parallel constructions. The following are equivalent:\n\n![b7350bfb.png](b7350bfb-kl2ssw7t.png)\nMUXs are very common in circuit design.\n\n#### video 2\n!!! note Read Only Memory\nROM.\nA table of $2^n$ m-bit words.\nCan think of ROM as implementing , one-bit functions of n variables.\n!!!\n\n### Clocks and Sequential Circuits\nThere are two types of sequential circuits:\n- Synchronous: has a clock. Memory changes only at discrete points in time.\n- Asyncronous: no clock. It's potentially faster and less power-hungry, but it's harder to design and analyse.\n\nOk, but what's a clock?\n\nA clock is a controlled input signal into the system.\n![c4131564.png](c4131564-kl2ssw7u.png)\n\nThe clock is literally just an inverter where the input drives the output. So it becomes and oscillator.\n\n\n### SR Latch\nThe simplest block of Memory.\nWe need a block to store a binary 0 or 1.\n- Set: set Q to 1\n- Reset: set Q to 0\n\n![13b23705.png](13b23705-kl2ssw7t.png)\n\nImportantly, if $R = 1, S = 1$, Then $Q$ oscillates, and is illogical.\n\nRemember, this SR latch is asynchronous, meaning it doesn't depend on a clock.\n\n### D Latch\nLike SR, but now with a clock pulse.\n![1cba1067.png](1cba1067-kl2ssw7t.png)\n\n![1f028128.png](:storage/39d78a8c-5f84-487a-b71b-1416caecd495/1f028128.png)\n\nHowever, this latch is also not perfect. Any change in D during the HIGH clock phase will be reflected in Q, at least momentarily. A good way to think about the D latch is that any time the clock is high, Q = D. When the clock switches to low, the value of Q is preserved. It's stateful.\n\n## D flip-flop\n![f2634bf2.png](f2634bf2-kl2ssw7t.png)\n\nThe D Flip-Flop doesn't get affected by bumps in the $D$ signal.\nAlso, The update to $Q_E$ occurs on the **falling edge** of the clock pulse.","tags":[],"folderPathname":"/imported/CS251","data":{},"createdAt":"2020-05-26T16:58:18.320Z","updatedAt":"2020-08-14T17:46:18.909Z","trashed":true,"_rev":"1dhbOwD-WRV"}