{"_id":"note:x_PdFrXfQjP","title":"Intro to Econ","content":"# Intro to Econ\n### Definition:\n\nEconomics is the social science that studies choices that individuals, businesses, gorvernment, and entire societies make as they cope with scarcity and incentives that influences these choices.\n\n!!! note Scarcity\nOur inability to satisfy all of our unlimited wants. Think about it; Economics is useless if we don't want anything, if we're completely satisfied. The limitations causing scarcity can be income, time, wealth, etc.\n!!!\n\n!!! note Incentives\nRewards or punishments for certain actions/choices.\n!!!\n\nEconomics is about **people**, not money.\n\n!!! note Positive Statement\nA testable statement about economics that economists generally agree on.\n* \"Higher taxes on cigarettes will increase the price of cigarettes.\"\n!!!\n\n!!! note Normative Statement\nA subjective statement of \"what ought to be\".\n* \"The taxes on cigarettes should be raised\"\n!!!\n\nA lot of economics is building **models**. The way we evaluate these models is by their ability to predict outcomes, just like in ML.\n\n!!! note Opportunity Cost\nThe highest value alternative that we must give up in order to get a thing. \"What else could you have, instead of this?\" This is the classic \"there's no such thing as a free lunch.\" Every time we make a choice, we're giving up something else. Opportunity Cost is the most valueable thing we're giving up.\n\n\n* If I choose guac over salsa in my burrito, my opportunity cost is salsa.\n* If I choose to go to university, my opportunity cost is full-time work, including salary and experience.\n!!!\n\n!!! note Microeconomics\nThe focus of this course. Behaviour of consumers, firms, and specific market activity all fall under this branch of economics.\n\n\"Microeconomics is the study of the allocation of scarce resources.\"\n!!!\n\n!!! note Macroeconomics\nECON102. Larger market sectors and the relationship among market sectors.\n!!!\n\n!!! note Marginal opportunity costs\nLike opportunity costs, but in small steps. It's like fine-grain decisions. How much should I work?\n* If I game for one hour instead of working at my day job, then my opportunity cost is my hourly wage, something like $29.\n!!!\n\n","tags":[],"folderPathname":"/ECON101-201","data":{},"createdAt":"2020-05-19T20:32:43.388Z","updatedAt":"2021-02-01T18:04:04.993Z","trashed":false,"_rev":"vmPV974qN6h"}