{"_id":"note:ymlhhZOBmXg","title":"Module 09: Social Welfare","content":"# Module 09: Social Welfare\n\n!!! abstract Price Ceiling (or price gap)\na regulation that makes it illeal to charge a price higher than a specified level. When applied, to rent, it's called a **rent ceiling**.\n!!!\n\nA price ceiling has no effect if it's set above the equilibrium point, because the price naturally doesn't go that high.\n\nHowever, if the rent ceiling is below the eqilibrium point, we get:\n* A housing shortage\n* Increased search activity (more people wasting time looking for housing)\n* A black market (spooky)\n\n![7d21bb95.png](7d21bb95-kl2t950z.png)\n\nThese are all pretty explainable. Obviously, if there's a rent ceiling, demand outweights supply and there's a shortage. More people are looking for a place as a result, so search activity increases. Formally, search activity is defined as \"time spent looking for someone with whom to do business.\"\n\nA **black market** is a market that operates in the illegal region of the market. People are still willing to pay more for a house, but they must do so illegally. The suppliers are selling for illegally high prices, but as long as people are buying and both are okay with skirting the law... The black market exists.\n\n!!! question Are rent ceilings fair?\nIn terms of **fair rules**, rent ceilings are **unfair** because they block voluntary exchange (legal voluntary exchange in the illegal region). Also, according to the **fair-results** view, rent ceilings are **unfair** because they generally don't benefit the poor.\n!!!\n\nA rent ceiling decreases the quantity of housing, so housing becomes scarce. There's more homelessness, and there are weird ways for allocating housing:\n1. Lottery: you have the option to buy a house if you're lucky :/\n2. First-come-first-serve: those can buy a house first get the house, or those with more foresight or a more stable income.\n3. Discrimination: Giving housing to those like you. This could be your friends, family, people at your church, etc. If housing is scarce and you're a supplier, you want to help your own.\n\nA rent ceiling lower than the equilibrium leads to inefficient **underproduction** of housing services.\n\n![38dcea42.png](38dcea42-kl2t950y.png)\n\n![9eb40135.png](9eb40135-kl2t950z.png)\n\n---\n\n!!! abstract Price floor\nA price floor is a regulation that makes it illegal to trade at a price lower than a specified level. When applied to labour markets, this is called **minimum wage**.\n!!!\n\nWhat are the effects of a minimum wage that is above the equilibrium point?\n**Persistent unemployment**. This is because there's more supply of labour than there is demand for labour, at the minimum wage. This is obviously inefficient. It should be noted however, that if you look at the diagram below, the worker's surplus is greater if they capitalize on the brown and peach regions - that is, if they don't waste resources finding a job. Minimum wage introduces a loss, however in this example the workers do benefit, or think they're benefitting.\n\n\n![0c2e3888.png](0c2e3888-kl2t950y.png)\n\n![1f64bd55.png](1f64bd55-kl2t950y.png)\n\n---\n\n!!! abstract Production quota\nan **upper limit** to the quantity of a good that may be produced during a specified period. This often raises the price because the resource becomes more scarce.\n!!!\n\n![a662a30b.png](a662a30b-kl2t950z.png)\n\n!!! abstract Subsidy\nA payment made by the government to a producer.\n!!!\n\n![46aed342.png](46aed342-kl2t950z.png)\n\n---\n\n### Taxes\n\n\n!!! abstract Tax incidence\nThe division of the burden of a tax between the buyers and the sellers. It's the tax split.\n!!!\n\nConsider a price change due to tax, at checkout:\n1. If the price rises by the amount of the tax, then **the buyers pay the tax**.\n2. If the price rises by a lesser amount than the tax amount, then **the buyers and sellers share the burden of the tax**.\n3. If the price doesn't rise at all, then the seller is paying the tax.\n\nSo tax incidence doesn't actually depend on the tax law, and it's the same result if we tax sellers or buyers:\n\n![6716d6b3.png](6716d6b3-kl2t950z.png)\n\n![2df6c3ad.png](2df6c3ad-kl2t950y.png)\nNote: There's an error in the above graph: the green \"Price kept by producers\" should point at 5.\n\nSo ok, here's the cool part: **The actual division of tax between buyers and sellers depends on the elasticities of demand and supply**. Consider the extreme cases:\n\n!!! note Perfectly Inelastic Demand\nThis is when demand curve is vertical, and the price doesn't affect how much people consume. In this case, the buyer pays the entire tax no matter what because they buy the same quantity no matter what.\n\n![ad4dd560.png](ad4dd560-kl2t950z.png)\n\n!!!\n\n!!! note Perfectly Elastic Demand\nThis is when the demand curve is vertical; this fixes the price, and the quantity is determined by the supply curve. Basically, the consumers won't buy any of the good if it's not at the market price, so suppliers must absorb the burden of the tax.\n\n![fe017ab5.png](fe017ab5-kl2t9510.png)\n\n!!!\n\n!!! note Perfectly Inelastic Supply\n\nThis is when the supply curve is vertical. In this case, the sellers pay the entire tax, because the price shifts down without the supply changing.\n\n![d76520a4.png](d76520a4-kl2t950z.png)\n!!!\n\n!!! note Perfectly Elastic Supply\nThis is when the supply curve is horizontal. When a tax is imposed on this good, buyers pay the entire tax.\n\n![f9c7fc34.png](f9c7fc34-kl2t950z.png)\n\n!!!\n\n### The bottom line:\n\n**Taxes are levied on goods with inelastic demand or inelastic supply**\nAlcohol, tobacco, and gas have inelastic demand, so buyers pay most of the tax.\n\nLabour has low elasticity of supply, so the worker pays most of the income tax and most of the social security tax.\n\n### Taxes and inefficiency\nIntroducing a tax introduced inefficiency, in all but extreme cases.\n\n![45a94d04.png](45a94d04-kl2t950y.png)\n\n### Taxes and Fairness\n\nThere are generally two main ideas on who should pay tax:\n\nThere's the **benefits principle**, which says that those who use the benefits paid for by taxes should really be the ones paying for them.\n\nThen there's the **ability-to-pay principle**, which says that people who can pay should pay more than those that cannot. Those that can shoulder the burden should. This is the tax brackets thing, and usually what we use in Canada. Importantly, this is bracketed, so making more money is never really a disadvantage. If it were, we would have horrible inefficiency.","tags":[],"folderPathname":"/ECON101-201","data":{},"createdAt":"2020-07-09T19:39:13.115Z","updatedAt":"2020-08-09T19:25:42.605Z","trashed":false,"_rev":"-VQW4JhMI8u"}