{"title":"RC4 and WEP: Case study","content":"\n![](image-kjx39xet.png)\n\nWEP is Wired Equivalent Privacy\n![](image-kjx3at07.png)\n\nSecurity between device and router (access point).\n\n## Goals of WEP\n1. Confidentiality -> Use RC4\n2. Data Integrity -> integrity checksum is used\n3. Access Control -> discard packets that are not properly encrypted using WEP.\n\n![](image-kjx3eool.png)\n\n![](image-kjx3hbx4.png)\n\n![](image-kjx3ixj7.png)\n\n\nThis got broken in 2001. A UW prof is involved, Ian Goldberg. \n\n\n![](image-kjx3n545.png)\n\nAnd the thing is, IV collision is actually highly probable on a busy network. there are only $2^{24}$ possible IVs, so collisions are guaranteed given enough traffic.\n\nAfter only about $2^{12}$ packets, we expect a collision. Similar to the birthday paradox.\n\nCollisions are more likely if keys are long-lived and the same key is used for multiple mobile stations. \n\n### Confidentiality is BROKEN!\n\n![](image-kjx3ukrz.png)\n\nIt's a valid encryped packet because CRC is **linear**. $CRC(x \\oplus y) = CRC(x) \\oplus CRC(y)$.\n\n\n### Integrity is BROKEN!!!\n\n![](image-kjx3xs1d.png)\n\n### Access control is BROKEN!!!\n\n\nA lot of commotion when these were uncovered. They were undiscovered for 2 years, because the protocol was not made public.\n\n![](image-kjx40ppw.png)\n\nThis only takes 100 dollars and a hacked driver to execute. The 5 million packets can be captured in a few hours, and then boom! you're in.\n\nPrograms like https://www.aircrack-ng.org/, https://sourceforge.net/projects/wepcrack/, can get you through in hours. You just have to find a WEP access point.\n\naircrack-ptw can break WEP in under 60 seconds.\n\nWPA2 is now the standard, using IEEE 802.11i. It uses AES\n\nBut of course, WEP is still out there.\n\nBut then WPA2 was broken by the KRACK attack, october 2017.\n\nWPA3 was adopted in Jan 2018, with further improvements.\n\nDragonblood attack was disclosed for WPA3 in April 2019.\n\n![](image-kjx4alqv.png)","tags":[],"folderPathname":"/CO487","data":{},"createdAt":"2021-01-14T16:43:10.331Z","updatedAt":"2021-01-14T17:19:06.415Z","trashed":false,"_id":"note:YYL7B4R6T","_rev":"53-6244e53865c420214b04f9c5eb76ae0b"}