{"_id":"note:zETWHlgO40T","title":"Week 12: Parallel Computation","content":"## Week 12: Parallel Computation\n\nMotivations are obvious. Redundancy, increased throughput, scalability.\n\nBut how do we solve issues of data sharing, and number of workers, and coordination?\n\nObviously, there are limitations to the coordination. 2x the cores doesn't mean 2x the speed.\n\nWe also need to make sure multiple things take parallelism into account:\n![3cae9bde.png](3cae9bde-kl2t950q.png)\n\n### Terminology:\n\nThere's a measure of **parallelizability**: how much of the program can execute at the same time? It's how effective we can split up the tasks among the cores.\n\n![9d79c5ef.png](9d79c5ef-kl2t950r.png)\n\n![5672d1b6.png](5672d1b6-kl2t950r.png)\n\n\n![3707f3d0.png](3707f3d0-kl2t950q.png)\n\nAn example of parallelism is bubble sort. Or merge sort. You can assign the sorting of two different sub-arrays to two different cores. \n\n---\n\n![daafe66a.png](daafe66a-kl2t950r.png)\n\n![49dfa423.png](49dfa423-kl2t950r.png)\n\n![6fe1d178.png](6fe1d178-kl2t950r.png)\n\nMessages can be passed between processors. It's fast but expensive.\n\nOne issue we run into is **cache coherency**: how do we sync data among the caches of all the processors?\n\n![855308ff.png](855308ff-kl2t950r.png)\n\nOne idea to solave cache coherency is a snooping protocol: each processor's cache monitors the bus for updates. This really increases bus traffic, limints scalability, but is fast. This is called **write update**.\n\nThe better idea is called **Write-invalidate**: When a processor writes to a block, it sends a message to all other cores to invalidate their version of the block. This is less bus traffic because there's only one bit being passed.\n\n---\n\n## Network Topology\n\nHow do we organize the cores?\n\nRings, Meshes, Cubes?\n\nWe need to consider communication latency, fault tolarance, and enery cost, and heat dissipation.\n\n![31d80d9b.png](31d80d9b-kl2t950q.png)\n\nwtffffff. Processors are squares.","tags":[],"folderPathname":"/CS251","data":{},"createdAt":"2020-07-29T16:04:04.554Z","updatedAt":"2020-07-29T19:33:30.726Z","trashed":false,"_rev":"m_MSHyLdQX6"}